# GetCustomConstraints Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetCustomConstraints Method
RebarUpdateCurvesData Class See Also
---
Gets all rebar constraints that are attached to custom handles for this rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<RebarConstraint> GetCustomConstraints()
```

Visual Basic
---
```text
Public Function GetCustomConstraints As IList(Of RebarConstraint)
```

Visual C++
---
```text
public:
IList<RebarConstraint^>^ GetCustomConstraints()
```

# ### Return Value
Returns all rebar constraints that are attached to custom handles for this rebar. This array does not contains the start and end constraints.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace